In [1]:
import pandas as pd
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', 
                      sep = '|', 
                      header = None, 
                      names = user_cols, 
                      index_col = 'user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [2]:
users.zip_code.duplicated()
# 发现有重复的zip_cope

user_id
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29      True
30     False
       ...
914    False
915    False
916    False
917    False
918    False
919     True
920    False
921    False
922     True
923    False
924    False
925    False
926    False
927    False
928     True
929     True
930    False
931    False
932    False
933    False
934     True
935    False
936    False
937     True
938    False
939    False
940     True
941    False
942    False
943    False
Name: zip_code, Length: 943, dtype: bool

In [3]:
users.zip_code.duplicated().sum()

148

In [4]:
users.duplicated()

user_id
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
30     False
       ...
914    False
915    False
916    False
917    False
918    False
919    False
920    False
921    False
922    False
923    False
924    False
925    False
926    False
927    False
928    False
929    False
930    False
931    False
932    False
933    False
934    False
935    False
936    False
937    False
938    False
939    False
940    False
941    False
942    False
943    False
Length: 943, dtype: bool

In [5]:
users.duplicated().sum()
# 发现整个数据集中也有重复的样本,7个

7

In [6]:
# 找到重复的样本
users.loc[users.duplicated(), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [7]:
# duplicated有参数keep，取值有first,last, False
# first: 保留第一个出现的值，剩余的认为是重复的（默认）
# last: 保留最后一个出现的值，其他的认为是重复的
# False：把所有值全部显示出来
users.loc[users.duplicated(keep = 'first'), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [8]:
users.loc[users.duplicated(keep = 'last'), :]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [9]:
users.loc[users.duplicated(keep = False), :]
# 发现每个样本都是两个重复值，因此全部显示的话，一共14个样本

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [10]:
# 删除重复值
# 1.保留第一个出现的值，删除剩余的值
users.drop_duplicates(keep = 'first').shape

(936, 4)

In [11]:
# 2.保留最后出现的值，删除剩余的值
users.drop_duplicates(keep = 'last').shape

(936, 4)

In [12]:
# 3.全部删除，一个都不留
users.drop_duplicates(keep = False).shape

(929, 4)

In [14]:
# 技巧，考虑部分字段插叙是否有重复值
# 考虑age和zip_code，如果两个字段的值都相同，认为是重复值
users.duplicated(subset = ['age', 'zip_code']).sum()
# 发现有16个重复值

16

In [15]:
# 删除以上的重复值
users.drop_duplicates(subset = ['age', 'zip_code'], keep = 'first').shape

(927, 4)